smart_adaptor_server/app/controllers/adaptor_controller.rb

SELECT  "smart_adaptors".* FROM "smart_adaptors" WHERE "smart_adaptors"."name" = ? ORDER BY "smart_adaptors"."id" ASC LIMIT ?  [["name", "adaptor1"], ["LIMIT", 1]]
INSERT INTO "smart_adaptors" ("name", "state", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "adaptor1"], ["state", "f"], ["created_at", "2018-04-23 07:30:14.859986"], ["updated_at", "2018-04-23 07:30:14.859986"]]
---
  def register
    if !SmartAdaptor.where(name: params[:name]).first.nil?
      render json: { msg: "ERROR: Adaptor name already used" }
    else
      @a = SmartAdaptor.create(name: params[:name], state: false, opto_state: false)

SELECT  "smart_adaptors".* FROM "smart_adaptors" WHERE "smart_adaptors"."name" = ? ORDER BY "smart_adaptors"."id" ASC LIMIT ?  [["name", "adaptor1"], ["LIMIT", 1]]
UPDATE "smart_adaptors" SET "state" = ?, "updated_at" = ? WHERE "smart_adaptors"."id" = ?  [["state", "t"], ["updated_at", "2018-04-23 07:31:36.284812"], ["id", 1]]
---
  def power_on
    @a = SmartAdaptor.where(name: params[:name]).first
    @a.update(state: true)

SELECT  "smart_adaptors".* FROM "smart_adaptors" WHERE "smart_adaptors"."name" = ? ORDER BY "smart_adaptors"."id" ASC LIMIT ?  [["name", "adaptor1"], ["LIMIT", 1]]
UPDATE "smart_adaptors" SET "state" = ?, "updated_at" = ? WHERE "smart_adaptors"."id" = ?  [["state", "f"], ["updated_at", "2018-04-23 07:31:49.743341"], ["id", 1]]
---
  def power_off
    @a = SmartAdaptor.where(name: params[:name]).first
    @a.update(state: false)

SELECT  "smart_adaptors".* FROM "smart_adaptors" WHERE "smart_adaptors"."name" = ? ORDER BY "smart_adaptors"."id" ASC LIMIT ?  [["name", "adaptor1"], ["LIMIT", 1]]
---
  def get_state
    @a = SmartAdaptor.where(name: params[:name]).first

SELECT "smart_adaptors".* FROM "smart_adaptors"
---
  def list
    @a_list = []
    SmartAdaptor.all.each { |a| @a_list.append({ name: a.name, state: a.state, opto_state: a.opto_state, last_on: a.last_on }) }